MikroElektronika/core_packages/ARM/gcc_clang/def/stm/STM32L562QE/mcu.h
typedef struct
{
  __IO uint32_t ACR;              /*!< FLASH access control register,                  Address offset: 0x00 */
  __IO uint32_t PDKEYR;           /*!< FLASH power down key register,                  Address offset: 0x04 */
  __IO uint32_t NSKEYR;           /*!< FLASH non-secure key register,                  Address offset: 0x08 */
  __IO uint32_t SECKEYR;          /*!< FLASH secure key register,                      Address offset: 0x0C */
  __IO uint32_t OPTKEYR;          /*!< FLASH option key register,                      Address offset: 0x10 */
  __IO uint32_t LVEKEYR;          /*!< FLASH LVE key register,                         Address offset: 0x14 */
  __IO uint32_t RESERVED1[2];     /*!< Reserved1,                                      Address offset: 0x18-0x1C */
  __IO uint32_t NSSR;             /*!< FLASH non-secure status register,               Address offset: 0x20 */
  __IO uint32_t SECSR;            /*!< FLASH secure status register,                   Address offset: 0x24 */
  __IO uint32_t NSCR;             /*!< FLASH non-secure control register,              Address offset: 0x28 */
  __IO uint32_t SECCR;            /*!< FLASH secure control register,                  Address offset: 0x2C */
  __IO uint32_t ECCR;             /*!< FLASH ECC register,                             Address offset: 0x30 */
  __IO uint32_t RESERVED2[3];     /*!< Reserved2,                                      Address offset: 0x34-0x3C */
  __IO uint32_t OPTR;             /*!< FLASH option control register,                  Address offset: 0x40 */
  __IO uint32_t NSBOOTADD0R;      /*!< FLASH non-secure boot address 0 register,       Address offset: 0x44 */
  __IO uint32_t NSBOOTADD1R;      /*!< FLASH non-secure boot address 1 register,       Address offset: 0x48 */
  __IO uint32_t SECBOOTADD0R;     /*!< FLASH secure boot address 0 register,           Address offset: 0x4C */
  __IO uint32_t SECWM1R1;         /*!< FLASH watermark-based secure register 1 bank 1, Address offset: 0x50 */
  __IO uint32_t SECWM1R2;         /*!< FLASH watermark-based secure register 2 bank 1, Address offset: 0x54 */
  __IO uint32_t WRP1AR;           /*!< FLASH WRP area A register bank 1,               Address offset: 0x58 */
  __IO uint32_t WRP1BR;           /*!< FLASH WRP area B register bank 1,               Address offset: 0x5C */
  __IO uint32_t SECWM2R1;         /*!< FLASH watermark-based secure register 1 bank 2, Address offset: 0x60 */
  __IO uint32_t SECWM2R2;         /*!< FLASH watermark-based secure register 2 bank 2, Address offset: 0x64 */
  __IO uint32_t WRP2AR;           /*!< FLASH WRP area A register bank 2,               Address offset: 0x68 */
  __IO uint32_t WRP2BR;           /*!< FLASH WRP area B register bank 2,               Address offset: 0x6C */
  __IO uint32_t RESERVED3[4];     /*!< Reserved3,                                      Address offset: 0x70-0x7C */
  __IO uint32_t SECBB1R1;         /*!< FLASH block-based secure bank 1,                Address offset: 0x80 */
  __IO uint32_t SECBB1R2;         /*!< FLASH block-based secure bank 1,                Address offset: 0x84 */
  __IO uint32_t SECBB1R3;         /*!< FLASH block-based secure bank 1,                Address offset: 0x88 */
  __IO uint32_t SECBB1R4;         /*!< FLASH block-based secure bank 1,                Address offset: 0x8C */
  __IO uint32_t RESERVED4[4];     /*!< Reserved4,                                      Address offset: 0x90-0x9C */
  __IO uint32_t SECBB2R1;         /*!< FLASH block-based secure bank 2,                Address offset: 0xA0 */
  __IO uint32_t SECBB2R2;         /*!< FLASH block-based secure bank 2,                Address offset: 0xA4 */
  __IO uint32_t SECBB2R3;         /*!< FLASH block-based secure bank 2,                Address offset: 0xA8 */
  __IO uint32_t SECBB2R4;         /*!< FLASH block-based secure bank 2,                Address offset: 0xAC */
  __IO uint32_t RESERVED5[4];     /*!< Reserved5,                                      Address offset: 0xB0-0xBC */
  __IO uint32_t SECHDPCR;         /*!< FLASH secure HDP control register,              Address offset: 0xC0 */
  __IO uint32_t PRIVCFGR;         /*!< FLASH privilege configuration register,         Address offset: 0xC4 */
} FLASH_TypeDef;

/**
  * @brief Flexible Memory Controller
  */

typedef struct
{
  __IO uint32_t BTCR[8];     /*!< NOR/PSRAM chip-select control register(BCR) and chip-select timing register(BTR), Address offset: 0x00-1C */
  __IO uint32_t PCSCNTR;     /*!< PSRAM chip-select counter register,                                               Address offset:    0x20 */
} FMC_Bank1_TypeDef;

/**
  * @brief Flexible Memory Controller Bank1E
  */

typedef struct
{
  __IO uint32_t BWTR[7];     /*!< NOR/PSRAM write timing registers, Address offset: 0x104-0x11C */
} FMC_Bank1E_TypeDef;

/**
  * @brief Flexible Memory Controller Bank3
  */

typedef struct
{
  __IO uint32_t PCR;        /*!< NAND Flash control register,                       Address offset: 0x80 */
  __IO uint32_t SR;         /*!< NAND Flash FIFO status and interrupt register,     Address offset: 0x84 */
  __IO uint32_t PMEM;       /*!< NAND Flash Common memory space timing register,    Address offset: 0x88 */
  __IO uint32_t PATT;       /*!< NAND Flash Attribute memory space timing register, Address offset: 0x8C */
  uint32_t      RESERVED0;  /*!< Reserved, 0x90                                                            */
  __IO uint32_t ECCR;       /*!< NAND Flash ECC result registers,                   Address offset: 0x94 */
} FMC_Bank3_TypeDef;

/**
  * @brief General Purpose I/O
  */

typedef struct
{
  __IO uint32_t MODER;       /*!< GPIO port mode register,               Address offset: 0x00      */
  __IO uint32_t OTYPER;      /*!< GPIO port output type register,        Address offset: 0x04      */
  __IO uint32_t OSPEEDR;     /*!< GPIO port output speed register,       Address offset: 0x08      */
  __IO uint32_t PUPDR;       /*!< GPIO port pull-up/pull-down register,  Address offset: 0x0C      */
  __IO uint32_t IDR;         /*!< GPIO port input data register,         Address offset: 0x10      */
  __IO uint32_t ODR;         /*!< GPIO port output data register,        Address offset: 0x14      */
  __IO uint32_t BSRR;        /*!< GPIO port bit set/reset  register,     Address offset: 0x18      */
  __IO uint32_t LCKR;        /*!< GPIO port configuration lock register, Address offset: 0x1C      */
  __IO uint32_t AFR[2];      /*!< GPIO alternate function registers,     Address offset: 0x20-0x24 */
  __IO uint32_t BRR;         /*!< GPIO Bit Reset register,               Address offset: 0x28      */
       uint32_t RESERVED;    /*!< Reserved,                              Address offset: 0x2C */
  __IO uint32_t SECCFGR;     /*!< GPIO Security configuration register,  Address offset: 0x30      */
} GPIO_TypeDef;

/**
  * @brief Global TrustZone Controller
  */

