MikroElektronika/core_packages/ARM/gcc_clang/def/stm/STM32L562QE/mcu.h
#define DMA2_Channel5                  DMA2_Channel5_NS
#define DMA2_Channel5_BASE             DMA2_Channel5_BASE_NS

#define DMA2_Channel6                  DMA2_Channel6_NS
#define DMA2_Channel6_BASE             DMA2_Channel6_BASE_NS

#define DMA2_Channel7                  DMA2_Channel7_NS
#define DMA2_Channel7_BASE             DMA2_Channel7_BASE_NS

#define DMA2_Channel8                  DMA2_Channel8_NS
#define DMA2_Channel8_BASE             DMA2_Channel8_BASE_NS

#define DMAMUX1                        DMAMUX1_NS
#define DMAMUX1_BASE                   DMAMUX1_BASE_NS

#define DMAMUX1_Channel0               DMAMUX1_Channel0_NS
#define DMAMUX1_Channel0_BASE          DMAMUX1_Channel0_BASE_NS

#define DMAMUX1_Channel1               DMAMUX1_Channel1_NS
#define DMAMUX1_Channel1_BASE          DMAMUX1_Channel1_BASE_NS

#define DMAMUX1_Channel2               DMAMUX1_Channel2_NS
#define DMAMUX1_Channel2_BASE          DMAMUX1_Channel2_BASE_NS

#define DMAMUX1_Channel3               DMAMUX1_Channel3_NS
#define DMAMUX1_Channel3_BASE          DMAMUX1_Channel3_BASE_NS

#define DMAMUX1_Channel4               DMAMUX1_Channel4_NS
#define DMAMUX1_Channel4_BASE          DMAMUX1_Channel4_BASE_NS

#define DMAMUX1_Channel5               DMAMUX1_Channel5_NS
#define DMAMUX1_Channel5_BASE          DMAMUX1_Channel5_BASE_NS

#define DMAMUX1_Channel6               DMAMUX1_Channel6_NS
#define DMAMUX1_Channel6_BASE          DMAMUX1_Channel6_BASE_NS

#define DMAMUX1_Channel7               DMAMUX1_Channel7_NS
#define DMAMUX1_Channel7_BASE          DMAMUX1_Channel7_BASE_NS

#define DMAMUX1_Channel8               DMAMUX1_Channel8_NS
#define DMAMUX1_Channel8_BASE          DMAMUX1_Channel8_BASE_NS

#define DMAMUX1_Channel9               DMAMUX1_Channel9_NS
#define DMAMUX1_Channel9_BASE          DMAMUX1_Channel9_BASE_NS

#define DMAMUX1_Channel10              DMAMUX1_Channel10_NS
#define DMAMUX1_Channel10_BASE         DMAMUX1_Channel10_BASE_NS

#define DMAMUX1_Channel11              DMAMUX1_Channel11_NS
#define DMAMUX1_Channel11_BASE         DMAMUX1_Channel11_BASE_NS

#define DMAMUX1_Channel12              DMAMUX1_Channel12_NS
#define DMAMUX1_Channel12_BASE         DMAMUX1_Channel12_BASE_NS

#define DMAMUX1_Channel13              DMAMUX1_Channel13_NS
#define DMAMUX1_Channel13_BASE         DMAMUX1_Channel13_BASE_NS

#define DMAMUX1_Channel14              DMAMUX1_Channel14_NS
#define DMAMUX1_Channel14_BASE         DMAMUX1_Channel14_BASE_NS

#define DMAMUX1_Channel15              DMAMUX1_Channel15_NS
#define DMAMUX1_Channel15_BASE         DMAMUX1_Channel15_BASE_NS

#define DMAMUX1_RequestGenerator0      DMAMUX1_RequestGenerator0_NS
#define DMAMUX1_RequestGenerator0_BASE DMAMUX1_RequestGenerator0_BASE_NS

#define DMAMUX1_RequestGenerator1      DMAMUX1_RequestGenerator1_NS
#define DMAMUX1_RequestGenerator1_BASE DMAMUX1_RequestGenerator1_BASE_NS

#define DMAMUX1_RequestGenerator2      DMAMUX1_RequestGenerator2_NS
#define DMAMUX1_RequestGenerator2_BASE DMAMUX1_RequestGenerator2_BASE_NS

#define DMAMUX1_RequestGenerator3      DMAMUX1_RequestGenerator3_NS
#define DMAMUX1_RequestGenerator3_BASE DMAMUX1_RequestGenerator3_BASE_NS

#define DMAMUX1_ChannelStatus          DMAMUX1_ChannelStatus_NS
#define DMAMUX1_ChannelStatus_BASE     DMAMUX1_ChannelStatus_BASE_NS

#define DMAMUX1_RequestGenStatus       DMAMUX1_RequestGenStatus_NS
#define DMAMUX1_RequestGenStatus_BASE  DMAMUX1_RequestGenStatus_BASE_NS

#define GPIOA                          GPIOA_NS
#define GPIOA_BASE                     GPIOA_BASE_NS

#define GPIOB                          GPIOB_NS
#define GPIOB_BASE                     GPIOB_BASE_NS

#define GPIOC                          GPIOC_NS
#define GPIOC_BASE                     GPIOC_BASE_NS

#define GPIOD                          GPIOD_NS
#define GPIOD_BASE                     GPIOD_BASE_NS

#define GPIOE                          GPIOE_NS
#define GPIOE_BASE                     GPIOE_BASE_NS

#define GPIOF                          GPIOF_NS
#define GPIOF_BASE                     GPIOF_BASE_NS

#define GPIOG                          GPIOG_NS
#define GPIOG_BASE                     GPIOG_BASE_NS

#define GPIOH                          GPIOH_NS
#define GPIOH_BASE                     GPIOH_BASE_NS

#define PWR                            PWR_NS
#define PWR_BASE                       PWR_BASE_NS

#define EXTI                           EXTI_NS
#define EXTI_BASE                      EXTI_BASE_NS

#define ICACHE                         ICACHE_NS
#define ICACHE_BASE                    ICACHE_BASE_NS

#define GTZC_TZSC                      GTZC_TZSC_NS
#define GTZC_TZSC_BASE                 GTZC_TZSC_BASE_NS

#define GTZC_TZIC                      GTZC_TZIC_NS
#define GTZC_TZIC_BASE                 GTZC_TZIC_BASE_NS

#define GTZC_MPCBB2                    GTZC_MPCBB2_NS
#define GTZC_MPCBB2_BASE               GTZC_MPCBB2_BASE_NS

#define GTZC_MPCBB1                    GTZC_MPCBB1_NS
#define GTZC_MPCBB1_BASE               GTZC_MPCBB1_BASE_NS

#define RTC                            RTC_NS
#define RTC_BASE                       RTC_BASE_NS

#define TAMP                           TAMP_NS
#define TAMP_BASE                      TAMP_BASE_NS

#define TIM1                           TIM1_NS
#define TIM1_BASE                      TIM1_BASE_NS

#define TIM2                           TIM2_NS
#define TIM2_BASE                      TIM2_BASE_NS

#define TIM3                           TIM3_NS
#define TIM3_BASE                      TIM3_BASE_NS

#define TIM4                           TIM4_NS
#define TIM4_BASE                      TIM4_BASE_NS

#define TIM5                           TIM5_NS
#define TIM5_BASE                      TIM5_BASE_NS

#define TIM6                           TIM6_NS
#define TIM6_BASE                      TIM6_BASE_NS

#define TIM7                           TIM7_NS
#define TIM7_BASE                      TIM7_BASE_NS

#define TIM8                           TIM8_NS
#define TIM8_BASE                      TIM8_BASE_NS

#define TIM15                          TIM15_NS
#define TIM15_BASE                     TIM15_BASE_NS

#define TIM16                          TIM16_NS
#define TIM16_BASE                     TIM16_BASE_NS

