MikroElektronika/core_packages/ARM/gcc_clang/def/stm/STM32L562QE/mcu.h
/********************  Bits definition for DMAMUX_RGCFR register  ************/
#define DMAMUX_RGCFR_COF0_Pos                        (0U)
#define DMAMUX_RGCFR_COF0_Msk                        (0x1UL << DMAMUX_RGCFR_COF0_Pos)/*!< 0x00000001 */
#define DMAMUX_RGCFR_COF0                            DMAMUX_RGCFR_COF0_Msk
#define DMAMUX_RGCFR_COF1_Pos                        (1U)
#define DMAMUX_RGCFR_COF1_Msk                        (0x1UL << DMAMUX_RGCFR_COF1_Pos)/*!< 0x00000002 */
#define DMAMUX_RGCFR_COF1                            DMAMUX_RGCFR_COF1_Msk
#define DMAMUX_RGCFR_COF2_Pos                        (2U)
#define DMAMUX_RGCFR_COF2_Msk                        (0x1UL << DMAMUX_RGCFR_COF2_Pos)/*!< 0x00000004 */
#define DMAMUX_RGCFR_COF2                            DMAMUX_RGCFR_COF2_Msk
#define DMAMUX_RGCFR_COF3_Pos                        (3U)
#define DMAMUX_RGCFR_COF3_Msk                        (0x1UL << DMAMUX_RGCFR_COF3_Pos)/*!< 0x00000008 */
#define DMAMUX_RGCFR_COF3                            DMAMUX_RGCFR_COF3_Msk

/*****************************************************************************/
/*                                                                           */
/*                    External Interrupt/Event Controller                    */
/*                                                                           */
/*****************************************************************************/
/*******************  Bit definition for EXTI_RTSR1 register  ****************/
#define EXTI_RTSR1_RT0_Pos           (0U)
#define EXTI_RTSR1_RT0_Msk           (0x1UL << EXTI_RTSR1_RT0_Pos)             /*!< 0x00000001 */
#define EXTI_RTSR1_RT0               EXTI_RTSR1_RT0_Msk                        /*!< Rising trigger configuration for input line 0 */
#define EXTI_RTSR1_RT1_Pos           (1U)
#define EXTI_RTSR1_RT1_Msk           (0x1UL << EXTI_RTSR1_RT1_Pos)             /*!< 0x00000002 */
#define EXTI_RTSR1_RT1               EXTI_RTSR1_RT1_Msk                        /*!< Rising trigger configuration for input line 1 */
#define EXTI_RTSR1_RT2_Pos           (2U)
#define EXTI_RTSR1_RT2_Msk           (0x1UL << EXTI_RTSR1_RT2_Pos)             /*!< 0x00000004 */
#define EXTI_RTSR1_RT2               EXTI_RTSR1_RT2_Msk                        /*!< Rising trigger configuration for input line 2 */
#define EXTI_RTSR1_RT3_Pos           (3U)
#define EXTI_RTSR1_RT3_Msk           (0x1UL << EXTI_RTSR1_RT3_Pos)             /*!< 0x00000008 */
#define EXTI_RTSR1_RT3               EXTI_RTSR1_RT3_Msk                        /*!< Rising trigger configuration for input line 3 */
#define EXTI_RTSR1_RT4_Pos           (4U)
#define EXTI_RTSR1_RT4_Msk           (0x1UL << EXTI_RTSR1_RT4_Pos)             /*!< 0x00000010 */
#define EXTI_RTSR1_RT4               EXTI_RTSR1_RT4_Msk                        /*!< Rising trigger configuration for input line 4 */
#define EXTI_RTSR1_RT5_Pos           (5U)
#define EXTI_RTSR1_RT5_Msk           (0x1UL << EXTI_RTSR1_RT5_Pos)             /*!< 0x00000020 */
#define EXTI_RTSR1_RT5               EXTI_RTSR1_RT5_Msk                        /*!< Rising trigger configuration for input line 5 */
#define EXTI_RTSR1_RT6_Pos           (6U)
#define EXTI_RTSR1_RT6_Msk           (0x1UL << EXTI_RTSR1_RT6_Pos)             /*!< 0x00000040 */
#define EXTI_RTSR1_RT6               EXTI_RTSR1_RT6_Msk                        /*!< Rising trigger configuration for input line 6 */
#define EXTI_RTSR1_RT7_Pos           (7U)
#define EXTI_RTSR1_RT7_Msk           (0x1UL << EXTI_RTSR1_RT7_Pos)             /*!< 0x00000080 */
#define EXTI_RTSR1_RT7               EXTI_RTSR1_RT7_Msk                        /*!< Rising trigger configuration for input line 7 */
#define EXTI_RTSR1_RT8_Pos           (8U)
#define EXTI_RTSR1_RT8_Msk           (0x1UL << EXTI_RTSR1_RT8_Pos)             /*!< 0x00000100 */
#define EXTI_RTSR1_RT8               EXTI_RTSR1_RT8_Msk                        /*!< Rising trigger configuration for input line 8 */
#define EXTI_RTSR1_RT9_Pos           (9U)
#define EXTI_RTSR1_RT9_Msk           (0x1UL << EXTI_RTSR1_RT9_Pos)             /*!< 0x00000200 */
#define EXTI_RTSR1_RT9               EXTI_RTSR1_RT9_Msk                        /*!< Rising trigger configuration for input line 9 */
#define EXTI_RTSR1_RT10_Pos          (10U)
#define EXTI_RTSR1_RT10_Msk          (0x1UL << EXTI_RTSR1_RT10_Pos)            /*!< 0x00000400 */
#define EXTI_RTSR1_RT10              EXTI_RTSR1_RT10_Msk                       /*!< Rising trigger configuration for input line 10 */
#define EXTI_RTSR1_RT11_Pos          (11U)
#define EXTI_RTSR1_RT11_Msk          (0x1UL << EXTI_RTSR1_RT11_Pos)            /*!< 0x00000800 */
#define EXTI_RTSR1_RT11              EXTI_RTSR1_RT11_Msk                       /*!< Rising trigger configuration for input line 11 */
#define EXTI_RTSR1_RT12_Pos          (12U)
#define EXTI_RTSR1_RT12_Msk          (0x1UL << EXTI_RTSR1_RT12_Pos)            /*!< 0x00001000 */
#define EXTI_RTSR1_RT12              EXTI_RTSR1_RT12_Msk                       /*!< Rising trigger configuration for input line 12 */
#define EXTI_RTSR1_RT13_Pos          (13U)
#define EXTI_RTSR1_RT13_Msk          (0x1UL << EXTI_RTSR1_RT13_Pos)            /*!< 0x00002000 */
#define EXTI_RTSR1_RT13              EXTI_RTSR1_RT13_Msk                       /*!< Rising trigger configuration for input line 13 */
#define EXTI_RTSR1_RT14_Pos          (14U)
#define EXTI_RTSR1_RT14_Msk          (0x1UL << EXTI_RTSR1_RT14_Pos)            /*!< 0x00004000 */
#define EXTI_RTSR1_RT14              EXTI_RTSR1_RT14_Msk                       /*!< Rising trigger configuration for input line 14 */
#define EXTI_RTSR1_RT15_Pos          (15U)
#define EXTI_RTSR1_RT15_Msk          (0x1UL << EXTI_RTSR1_RT15_Pos)            /*!< 0x00008000 */
#define EXTI_RTSR1_RT15              EXTI_RTSR1_RT15_Msk                       /*!< Rising trigger configuration for input line 15 */
#define EXTI_RTSR1_RT16_Pos          (16U)
#define EXTI_RTSR1_RT16_Msk          (0x1UL << EXTI_RTSR1_RT16_Pos)            /*!< 0x00010000 */
#define EXTI_RTSR1_RT16              EXTI_RTSR1_RT16_Msk                       /*!< Rising trigger configuration for input line 16 */
#define EXTI_RTSR1_RT21_Pos          (21U)
#define EXTI_RTSR1_RT21_Msk          (0x1UL << EXTI_RTSR1_RT21_Pos)            /*!< 0x00200000 */
#define EXTI_RTSR1_RT21              EXTI_RTSR1_RT21_Msk                       /*!< Rising trigger configuration for input line 21 */
#define EXTI_RTSR1_RT22_Pos          (22U)
#define EXTI_RTSR1_RT22_Msk          (0x1UL << EXTI_RTSR1_RT22_Pos)            /*!< 0x00400000 */
#define EXTI_RTSR1_RT22              EXTI_RTSR1_RT22_Msk                       /*!< Rising trigger configuration for input line 22 */
#define EXTI_RTSR1_RT23_Pos          (23U)
#define EXTI_RTSR1_RT23_Msk          (0x1UL << EXTI_RTSR1_RT23_Pos)            /*!< 0x00800000 */
#define EXTI_RTSR1_RT23              EXTI_RTSR1_RT23_Msk                       /*!< Rising trigger configuration for input line 23 */
#define EXTI_RTSR1_RT24_Pos          (24U)
#define EXTI_RTSR1_RT24_Msk          (0x1UL << EXTI_RTSR1_RT24_Pos)            /*!< 0x01000000 */
#define EXTI_RTSR1_RT24              EXTI_RTSR1_RT24_Msk                       /*!< Rising trigger configuration for input line 24 */
#define EXTI_RTSR1_RT25_Pos          (25U)
#define EXTI_RTSR1_RT25_Msk          (0x1UL << EXTI_RTSR1_RT25_Pos)            /*!< 0x02000000 */
#define EXTI_RTSR1_RT25              EXTI_RTSR1_RT25_Msk                       /*!< Rising trigger configuration for input line 25 */
#define EXTI_RTSR1_RT26_Pos          (26U)
#define EXTI_RTSR1_RT26_Msk          (0x1UL << EXTI_RTSR1_RT26_Pos)            /*!< 0x04000000 */
#define EXTI_RTSR1_RT26              EXTI_RTSR1_RT26_Msk                       /*!< Rising trigger configuration for input line 26 */
#define EXTI_RTSR1_RT27_Pos          (27U)
#define EXTI_RTSR1_RT27_Msk          (0x1UL << EXTI_RTSR1_RT27_Pos)            /*!< 0x08000000 */
#define EXTI_RTSR1_RT27              EXTI_RTSR1_RT27_Msk                       /*!< Rising trigger configuration for input line 27 */
#define EXTI_RTSR1_RT28_Pos          (28U)
#define EXTI_RTSR1_RT28_Msk          (0x1UL << EXTI_RTSR1_RT28_Pos)            /*!< 0x10000000 */
#define EXTI_RTSR1_RT28              EXTI_RTSR1_RT28_Msk                       /*!< Rising trigger configuration for input line 28 */
#define EXTI_RTSR1_RT29_Pos          (29U)
#define EXTI_RTSR1_RT29_Msk          (0x1UL << EXTI_RTSR1_RT29_Pos)            /*!< 0x20000000 */
#define EXTI_RTSR1_RT29              EXTI_RTSR1_RT29_Msk                       /*!< Rising trigger configuration for input line 29 */
#define EXTI_RTSR1_RT30_Pos          (30U)
#define EXTI_RTSR1_RT30_Msk          (0x1UL << EXTI_RTSR1_RT30_Pos)            /*!< 0x40000000 */
#define EXTI_RTSR1_RT30              EXTI_RTSR1_RT30_Msk                       /*!< Rising trigger configuration for input line 30 */
#define EXTI_RTSR1_RT31_Pos          (31U)
#define EXTI_RTSR1_RT31_Msk          (0x1UL << EXTI_RTSR1_RT31_Pos)            /*!< 0x80000000 */
#define EXTI_RTSR1_RT31              EXTI_RTSR1_RT31_Msk                       /*!< Rising trigger configuration for input line 31 */

/*******************  Bit definition for EXTI_RTSR2 register  ****************/
#define EXTI_RTSR2_RT32_Pos          (0U)
#define EXTI_RTSR2_RT32_Msk          (0x1UL << EXTI_RTSR2_RT32_Pos)            /*!< 0x00000001 */
#define EXTI_RTSR2_RT32              EXTI_RTSR2_RT32_Msk                       /*!< Rising trigger configuration for input line 32 */
#define EXTI_RTSR2_RT33_Pos          (1U)
#define EXTI_RTSR2_RT33_Msk          (0x1UL << EXTI_RTSR2_RT33_Pos)            /*!< 0x00000002 */
#define EXTI_RTSR2_RT33              EXTI_RTSR2_RT33_Msk                       /*!< Rising trigger configuration for input line 33 */
#define EXTI_RTSR2_RT34_Pos          (2U)
#define EXTI_RTSR2_RT34_Msk          (0x1UL << EXTI_RTSR2_RT34_Pos)             /*!< 0x00000004 */
#define EXTI_RTSR2_RT34              EXTI_RTSR2_RT34_Msk                        /*!< Rising trigger configuration for input line 34 */
#define EXTI_RTSR2_RT35_Pos          (3U)
#define EXTI_RTSR2_RT35_Msk          (0x1UL << EXTI_RTSR2_RT35_Pos)             /*!< 0x00000008 */
#define EXTI_RTSR2_RT35              EXTI_RTSR2_RT35_Msk                        /*!< Rising trigger configuration for input line 35 */
#define EXTI_RTSR2_RT36_Pos          (4U)
#define EXTI_RTSR2_RT36_Msk          (0x1UL << EXTI_RTSR2_RT36_Pos)             /*!< 0x00000010 */
#define EXTI_RTSR2_RT36              EXTI_RTSR2_RT36_Msk                        /*!< Rising trigger configuration for input line 36 */
#define EXTI_RTSR2_RT37_Pos          (5U)
#define EXTI_RTSR2_RT37_Msk          (0x1UL << EXTI_RTSR2_RT37_Pos)             /*!< 0x00000020 */
#define EXTI_RTSR2_RT37              EXTI_RTSR2_RT37_Msk                        /*!< Rising trigger configuration for input line 37 */
#define EXTI_RTSR2_RT38_Pos          (6U)
#define EXTI_RTSR2_RT38_Msk          (0x1UL << EXTI_RTSR2_RT38_Pos)             /*!< 0x00000040 */
#define EXTI_RTSR2_RT38              EXTI_RTSR2_RT38_Msk                        /*!< Rising trigger configuration for input line 38 */
#define EXTI_RTSR2_RT39_Pos          (7U)
#define EXTI_RTSR2_RT39_Msk          (0x1UL << EXTI_RTSR2_RT39_Pos)             /*!< 0x00000080 */
#define EXTI_RTSR2_RT39              EXTI_RTSR2_RT39_Msk                        /*!< Rising trigger configuration for input line 39 */
#define EXTI_RTSR2_RT40_Pos          (8U)
#define EXTI_RTSR2_RT40_Msk          (0x1UL << EXTI_RTSR2_RT40_Pos)             /*!< 0x00000100 */
#define EXTI_RTSR2_RT40              EXTI_RTSR2_RT40_Msk                        /*!< Rising trigger configuration for input line 40 */
#define EXTI_RTSR2_RT41_Pos          (9U)
#define EXTI_RTSR2_RT41_Msk          (0x1UL << EXTI_RTSR2_RT41_Pos)             /*!< 0x00000200 */
#define EXTI_RTSR2_RT41              EXTI_RTSR2_RT41_Msk                        /*!< Rising trigger configuration for input line 41 */
#define EXTI_RTSR2_RT42_Pos          (10U)
#define EXTI_RTSR2_RT42_Msk          (0x1UL << EXTI_RTSR2_RT42_Pos)             /*!< 0x00000400 */
#define EXTI_RTSR2_RT42              EXTI_RTSR2_RT42_Msk                        /*!< Rising trigger configuration for input line 42 */

/*******************  Bit definition for EXTI_FTSR1 register  ****************/
#define EXTI_FTSR1_FT0_Pos           (0U)
#define EXTI_FTSR1_FT0_Msk           (0x1UL << EXTI_FTSR1_FT0_Pos)             /*!< 0x00000001 */
#define EXTI_FTSR1_FT0               EXTI_FTSR1_FT0_Msk                        /*!< Falling trigger configuration for input line 0 */
#define EXTI_FTSR1_FT1_Pos           (1U)
#define EXTI_FTSR1_FT1_Msk           (0x1UL << EXTI_FTSR1_FT1_Pos)             /*!< 0x00000002 */
#define EXTI_FTSR1_FT1               EXTI_FTSR1_FT1_Msk                        /*!< Falling trigger configuration for input line 1 */
#define EXTI_FTSR1_FT2_Pos           (2U)
#define EXTI_FTSR1_FT2_Msk           (0x1UL << EXTI_FTSR1_FT2_Pos)             /*!< 0x00000004 */
#define EXTI_FTSR1_FT2               EXTI_FTSR1_FT2_Msk                        /*!< Falling trigger configuration for input line 2 */
#define EXTI_FTSR1_FT3_Pos           (3U)
#define EXTI_FTSR1_FT3_Msk           (0x1UL << EXTI_FTSR1_FT3_Pos)             /*!< 0x00000008 */
#define EXTI_FTSR1_FT3               EXTI_FTSR1_FT3_Msk                        /*!< Falling trigger configuration for input line 3 */
#define EXTI_FTSR1_FT4_Pos           (4U)
#define EXTI_FTSR1_FT4_Msk           (0x1UL << EXTI_FTSR1_FT4_Pos)             /*!< 0x00000010 */
#define EXTI_FTSR1_FT4               EXTI_FTSR1_FT4_Msk                        /*!< Falling trigger configuration for input line 4 */
#define EXTI_FTSR1_FT5_Pos           (5U)
#define EXTI_FTSR1_FT5_Msk           (0x1UL << EXTI_FTSR1_FT5_Pos)             /*!< 0x00000020 */
#define EXTI_FTSR1_FT5               EXTI_FTSR1_FT5_Msk                        /*!< Falling trigger configuration for input line 5 */
#define EXTI_FTSR1_FT6_Pos           (6U)
#define EXTI_FTSR1_FT6_Msk           (0x1UL << EXTI_FTSR1_FT6_Pos)             /*!< 0x00000040 */
#define EXTI_FTSR1_FT6               EXTI_FTSR1_FT6_Msk                        /*!< Falling trigger configuration for input line 6 */
#define EXTI_FTSR1_FT7_Pos           (7U)
#define EXTI_FTSR1_FT7_Msk           (0x1UL << EXTI_FTSR1_FT7_Pos)             /*!< 0x00000080 */
#define EXTI_FTSR1_FT7               EXTI_FTSR1_FT7_Msk                        /*!< Falling trigger configuration for input line 7 */
#define EXTI_FTSR1_FT8_Pos           (8U)
#define EXTI_FTSR1_FT8_Msk           (0x1UL << EXTI_FTSR1_FT8_Pos)             /*!< 0x00000100 */
#define EXTI_FTSR1_FT8               EXTI_FTSR1_FT8_Msk                        /*!< Falling trigger configuration for input line 8 */
#define EXTI_FTSR1_FT9_Pos           (9U)
#define EXTI_FTSR1_FT9_Msk           (0x1UL << EXTI_FTSR1_FT9_Pos)             /*!< 0x00000200 */
#define EXTI_FTSR1_FT9               EXTI_FTSR1_FT9_Msk                        /*!< Falling trigger configuration for input line 9 */
#define EXTI_FTSR1_FT10_Pos          (10U)
#define EXTI_FTSR1_FT10_Msk          (0x1UL << EXTI_FTSR1_FT10_Pos)            /*!< 0x00000400 */
#define EXTI_FTSR1_FT10              EXTI_FTSR1_FT10_Msk                       /*!< Falling trigger configuration for input line 10 */
#define EXTI_FTSR1_FT11_Pos          (11U)
#define EXTI_FTSR1_FT11_Msk          (0x1UL << EXTI_FTSR1_FT11_Pos)            /*!< 0x00000800 */
#define EXTI_FTSR1_FT11              EXTI_FTSR1_FT11_Msk                       /*!< Falling trigger configuration for input line 11 */
#define EXTI_FTSR1_FT12_Pos          (12U)
#define EXTI_FTSR1_FT12_Msk          (0x1UL << EXTI_FTSR1_FT12_Pos)            /*!< 0x00001000 */
#define EXTI_FTSR1_FT12              EXTI_FTSR1_FT12_Msk                       /*!< Falling trigger configuration for input line 12 */
#define EXTI_FTSR1_FT13_Pos          (13U)
#define EXTI_FTSR1_FT13_Msk          (0x1UL << EXTI_FTSR1_FT13_Pos)            /*!< 0x00002000 */
#define EXTI_FTSR1_FT13              EXTI_FTSR1_FT13_Msk                       /*!< Falling trigger configuration for input line 13 */
#define EXTI_FTSR1_FT14_Pos          (14U)
#define EXTI_FTSR1_FT14_Msk          (0x1UL << EXTI_FTSR1_FT14_Pos)            /*!< 0x00004000 */
#define EXTI_FTSR1_FT14              EXTI_FTSR1_FT14_Msk                       /*!< Falling trigger configuration for input line 14 */
#define EXTI_FTSR1_FT15_Pos          (15U)
#define EXTI_FTSR1_FT15_Msk          (0x1UL << EXTI_FTSR1_FT15_Pos)            /*!< 0x00008000 */
#define EXTI_FTSR1_FT15              EXTI_FTSR1_FT15_Msk                       /*!< Falling trigger configuration for input line 15 */
#define EXTI_FTSR1_FT16_Pos          (16U)
#define EXTI_FTSR1_FT16_Msk          (0x1UL << EXTI_FTSR1_FT16_Pos)            /*!< 0x00010000 */
#define EXTI_FTSR1_FT16              EXTI_FTSR1_FT16_Msk                       /*!< Falling trigger configuration for input line 16 */
#define EXTI_FTSR1_FT21_Pos          (21U)
#define EXTI_FTSR1_FT21_Msk          (0x1UL << EXTI_FTSR1_FT21_Pos)            /*!< 0x00200000 */
#define EXTI_FTSR1_FT21              EXTI_FTSR1_FT21_Msk                       /*!< Falling trigger configuration for input line 21 */
#define EXTI_FTSR1_FT22_Pos          (22U)
#define EXTI_FTSR1_FT22_Msk          (0x1UL << EXTI_FTSR1_FT22_Pos)            /*!< 0x00400000 */
#define EXTI_FTSR1_FT22              EXTI_FTSR1_FT22_Msk                       /*!< Falling trigger configuration for input line 22 */
#define EXTI_FTSR1_FT23_Pos          (23U)
#define EXTI_FTSR1_FT23_Msk          (0x1UL << EXTI_FTSR1_FT23_Pos)            /*!< 0x00800000 */
#define EXTI_FTSR1_FT23              EXTI_FTSR1_FT23_Msk                       /*!< Falling trigger configuration for input line 23 */
#define EXTI_FTSR1_FT24_Pos          (24U)
#define EXTI_FTSR1_FT24_Msk          (0x1UL << EXTI_FTSR1_FT24_Pos)            /*!< 0x01000000 */
#define EXTI_FTSR1_FT24              EXTI_FTSR1_FT24_Msk                       /*!< Falling trigger configuration for input line 24 */
#define EXTI_FTSR1_FT25_Pos          (25U)
#define EXTI_FTSR1_FT25_Msk          (0x1UL << EXTI_FTSR1_FT25_Pos)            /*!< 0x02000000 */
#define EXTI_FTSR1_FT25              EXTI_FTSR1_FT25_Msk                       /*!< Falling trigger configuration for input line 25 */
#define EXTI_FTSR1_FT26_Pos          (26U)
#define EXTI_FTSR1_FT26_Msk          (0x1UL << EXTI_FTSR1_FT26_Pos)            /*!< 0x04000000 */
#define EXTI_FTSR1_FT26              EXTI_FTSR1_FT26_Msk                       /*!< Falling trigger configuration for input line 26 */
#define EXTI_FTSR1_FT27_Pos          (27U)
#define EXTI_FTSR1_FT27_Msk          (0x1UL << EXTI_FTSR1_FT27_Pos)            /*!< 0x08000000 */
#define EXTI_FTSR1_FT27              EXTI_FTSR1_FT27_Msk                       /*!< Falling trigger configuration for input line 27 */
#define EXTI_FTSR1_FT28_Pos          (28U)
#define EXTI_FTSR1_FT28_Msk          (0x1UL << EXTI_FTSR1_FT28_Pos)            /*!< 0x10000000 */
#define EXTI_FTSR1_FT28              EXTI_FTSR1_FT28_Msk                       /*!< Falling trigger configuration for input line 28 */
#define EXTI_FTSR1_FT29_Pos          (29U)
#define EXTI_FTSR1_FT29_Msk          (0x1UL << EXTI_FTSR1_FT29_Pos)            /*!< 0x20000000 */
#define EXTI_FTSR1_FT29              EXTI_FTSR1_FT29_Msk                       /*!< Falling trigger configuration for input line 29 */
#define EXTI_FTSR1_FT30_Pos          (30U)
#define EXTI_FTSR1_FT30_Msk          (0x1UL << EXTI_FTSR1_FT30_Pos)            /*!< 0x40000000 */
#define EXTI_FTSR1_FT30              EXTI_FTSR1_FT30_Msk                       /*!< Falling trigger configuration for input line 30 */
#define EXTI_FTSR1_FT31_Pos          (31U)
#define EXTI_FTSR1_FT31_Msk          (0x1UL << EXTI_FTSR1_FT31_Pos)            /*!< 0x80000000 */
#define EXTI_FTSR1_FT31              EXTI_FTSR1_FT31_Msk                       /*!< Falling trigger configuration for input line 31 */

/*******************  Bit definition for EXTI_FTSR2 register  ****************/
#define EXTI_FTSR2_FT32_Pos          (0U)
#define EXTI_FTSR2_FT32_Msk          (0x1UL << EXTI_FTSR2_FT32_Pos)            /*!< 0x00000001 */
#define EXTI_FTSR2_FT32              EXTI_FTSR2_FT32_Msk                       /*!< Falling trigger configuration for input line 32 */
#define EXTI_FTSR2_FT33_Pos          (1U)
#define EXTI_FTSR2_FT33_Msk          (0x1UL << EXTI_FTSR2_FT33_Pos)            /*!< 0x00000002 */
#define EXTI_FTSR2_FT33              EXTI_FTSR2_FT33_Msk                       /*!< Falling trigger configuration for input line 33 */
#define EXTI_FTSR2_FT34_Pos          (2U)
#define EXTI_FTSR2_FT34_Msk          (0x1UL << EXTI_FTSR2_FT34_Pos)             /*!< 0x00000004 */
#define EXTI_FTSR2_FT34              EXTI_FTSR2_FT34_Msk                        /*!< Falling trigger configuration for input line 34 */
#define EXTI_FTSR2_FT35_Pos          (3U)
#define EXTI_FTSR2_FT35_Msk          (0x1UL << EXTI_FTSR2_FT35_Pos)             /*!< 0x00000008 */
#define EXTI_FTSR2_FT35              EXTI_FTSR2_FT35_Msk                        /*!< Falling trigger configuration for input line 35 */
#define EXTI_FTSR2_FT36_Pos          (4U)
#define EXTI_FTSR2_FT36_Msk          (0x1UL << EXTI_FTSR2_FT36_Pos)             /*!< 0x00000010 */
#define EXTI_FTSR2_FT36              EXTI_FTSR2_FT36_Msk                        /*!< Falling trigger configuration for input line 36 */
#define EXTI_FTSR2_FT37_Pos          (5U)
#define EXTI_FTSR2_FT37_Msk          (0x1UL << EXTI_FTSR2_FT37_Pos)             /*!< 0x00000020 */
#define EXTI_FTSR2_FT37              EXTI_FTSR2_FT37_Msk                        /*!< Falling trigger configuration for input line 37 */
#define EXTI_FTSR2_FT38_Pos          (6U)
#define EXTI_FTSR2_FT38_Msk          (0x1UL << EXTI_FTSR2_FT38_Pos)             /*!< 0x00000040 */
#define EXTI_FTSR2_FT38              EXTI_FTSR2_FT38_Msk                        /*!< Falling trigger configuration for input line 38 */
#define EXTI_FTSR2_FT39_Pos          (7U)
#define EXTI_FTSR2_FT39_Msk          (0x1UL << EXTI_FTSR2_FT39_Pos)             /*!< 0x00000080 */
#define EXTI_FTSR2_FT39              EXTI_FTSR2_FT39_Msk                        /*!< Falling trigger configuration for input line 39 */
#define EXTI_FTSR2_FT40_Pos          (8U)
#define EXTI_FTSR2_FT40_Msk          (0x1UL << EXTI_FTSR2_FT40_Pos)             /*!< 0x00000100 */
#define EXTI_FTSR2_FT40              EXTI_FTSR2_FT40_Msk                        /*!< Falling trigger configuration for input line 40 */
#define EXTI_FTSR2_FT41_Pos          (9U)
#define EXTI_FTSR2_FT41_Msk          (0x1UL << EXTI_FTSR2_FT41_Pos)             /*!< 0x00000200 */
#define EXTI_FTSR2_FT41              EXTI_FTSR2_FT41_Msk                        /*!< Falling trigger configuration for input line 41 */
#define EXTI_FTSR2_FT42_Pos          (10U)
#define EXTI_FTSR2_FT42_Msk          (0x1UL << EXTI_FTSR2_FT42_Pos)             /*!< 0x00000400 */
#define EXTI_FTSR2_FT42              EXTI_FTSR2_FT42_Msk                        /*!< Falling trigger configuration for input line 42 */

