MikroElektronika/core_packages/ARM/gcc_clang/def/stm/STM32L562QE/mcu.h
/********************  Bit definition for PWR_CR3 register  ********************/
#define PWR_CR3_EWUP_Pos             (0U)
#define PWR_CR3_EWUP_Msk             (0x1FUL << PWR_CR3_EWUP_Pos)              /*!< 0x0000001F */
#define PWR_CR3_EWUP                 PWR_CR3_EWUP_Msk                          /*!< Enable Wake-Up Pins  */
#define PWR_CR3_EWUP1_Pos            (0U)
#define PWR_CR3_EWUP1_Msk            (0x1UL << PWR_CR3_EWUP1_Pos)              /*!< 0x00000001 */
#define PWR_CR3_EWUP1                PWR_CR3_EWUP1_Msk                         /*!< Enable Wake-Up Pin 1 */
#define PWR_CR3_EWUP2_Pos            (1U)
#define PWR_CR3_EWUP2_Msk            (0x1UL << PWR_CR3_EWUP2_Pos)              /*!< 0x00000002 */
#define PWR_CR3_EWUP2                PWR_CR3_EWUP2_Msk                         /*!< Enable Wake-Up Pin 2 */
#define PWR_CR3_EWUP3_Pos            (2U)
#define PWR_CR3_EWUP3_Msk            (0x1UL << PWR_CR3_EWUP3_Pos)              /*!< 0x00000004 */
#define PWR_CR3_EWUP3                PWR_CR3_EWUP3_Msk                         /*!< Enable Wake-Up Pin 3 */
#define PWR_CR3_EWUP4_Pos            (3U)
#define PWR_CR3_EWUP4_Msk            (0x1UL << PWR_CR3_EWUP4_Pos)              /*!< 0x00000008 */
#define PWR_CR3_EWUP4                PWR_CR3_EWUP4_Msk                         /*!< Enable Wake-Up Pin 4 */
#define PWR_CR3_EWUP5_Pos            (4U)
#define PWR_CR3_EWUP5_Msk            (0x1UL << PWR_CR3_EWUP5_Pos)              /*!< 0x00000010 */
#define PWR_CR3_EWUP5                PWR_CR3_EWUP5_Msk                         /*!< Enable Wake-Up Pin 5 */

#define PWR_CR3_RRS_Pos              (8U)
#define PWR_CR3_RRS_Msk              (0x3UL << PWR_CR3_RRS_Pos)                /*!< 0x00000100 */
#define PWR_CR3_RRS                  PWR_CR3_RRS_Msk                           /*!< RRS[1:0] bits (Ram retention in STANDBY mode)*/
#define PWR_CR3_RRS_0                (0x1UL << PWR_CR3_RRS_Pos)                /*!< 0x00000100 */
#define PWR_CR3_RRS_1                (0x2UL << PWR_CR3_RRS_Pos)                /*!< 0x00000200 */

#define PWR_CR3_APC_Pos              (10U)
#define PWR_CR3_APC_Msk              (0x1UL << PWR_CR3_APC_Pos)                /*!< 0x00000400 */
#define PWR_CR3_APC                  PWR_CR3_APC_Msk                           /*!< Apply pull-up and pull-down configuration */
#define PWR_CR3_ULPMEN_Pos           (11U)
#define PWR_CR3_ULPMEN_Msk           (0x1UL << PWR_CR3_ULPMEN_Pos)             /*!< 0x00000800 */
#define PWR_CR3_ULPMEN               PWR_CR3_ULPMEN_Msk                        /*!< Ultra Low Power Mode Enable */
#define PWR_CR3_UCPD_STDBY_Pos       (13U)
#define PWR_CR3_UCPD_STDBY_Msk       (0x1UL << PWR_CR3_UCPD_STDBY_Pos)         /*!< 0x00002000 */
#define PWR_CR3_UCPD_STDBY           PWR_CR3_UCPD_STDBY_Msk                    /*!< UCPD Configuration memorize when enter in STANDBY */
#define PWR_CR3_UCPD_DBDIS_Pos       (14U)
#define PWR_CR3_UCPD_DBDIS_Msk       (0x1UL << PWR_CR3_UCPD_DBDIS_Pos)         /*!< 0x00004000 */
#define PWR_CR3_UCPD_DBDIS           PWR_CR3_UCPD_DBDIS_Msk                    /*!< Dead Battery Behavior Disable */

/********************  Bit definition for PWR_CR4 register  ********************/
#define PWR_CR4_WUPP1_Pos            (0U)
#define PWR_CR4_WUPP1_Msk            (0x1UL << PWR_CR4_WUPP1_Pos)              /*!< 0x00000001 */
#define PWR_CR4_WUPP1                PWR_CR4_WUPP1_Msk                         /*!< Wake-Up Pin 1 polarity */
#define PWR_CR4_WUPP2_Pos            (1U)
#define PWR_CR4_WUPP2_Msk            (0x1UL << PWR_CR4_WUPP2_Pos)              /*!< 0x00000002 */
#define PWR_CR4_WUPP2                PWR_CR4_WUPP2_Msk                         /*!< Wake-Up Pin 2 polarity */
#define PWR_CR4_WUPP3_Pos            (2U)
#define PWR_CR4_WUPP3_Msk            (0x1UL << PWR_CR4_WUPP3_Pos)              /*!< 0x00000004 */
#define PWR_CR4_WUPP3                PWR_CR4_WUPP3_Msk                         /*!< Wake-Up Pin 3 polarity */
#define PWR_CR4_WUPP4_Pos            (3U)
#define PWR_CR4_WUPP4_Msk            (0x1UL << PWR_CR4_WUPP4_Pos)              /*!< 0x00000008 */
#define PWR_CR4_WUPP4                PWR_CR4_WUPP4_Msk                         /*!< Wake-Up Pin 4 polarity */
#define PWR_CR4_WUPP5_Pos            (4U)
#define PWR_CR4_WUPP5_Msk            (0x1UL << PWR_CR4_WUPP5_Pos)              /*!< 0x00000010 */
#define PWR_CR4_WUPP5                PWR_CR4_WUPP5_Msk                         /*!< Wake-Up Pin 5 polarity */
#define PWR_CR4_VBE_Pos              (8U)
#define PWR_CR4_VBE_Msk              (0x1UL << PWR_CR4_VBE_Pos)                /*!< 0x00000100 */
#define PWR_CR4_VBE                  PWR_CR4_VBE_Msk                           /*!< VBAT Battery charging Enable  */
#define PWR_CR4_VBRS_Pos             (9U)
#define PWR_CR4_VBRS_Msk             (0x1UL << PWR_CR4_VBRS_Pos)               /*!< 0x00000200 */
#define PWR_CR4_VBRS                 PWR_CR4_VBRS_Msk                          /*!< VBAT Battery charging Resistor Selection */
#define PWR_CR4_SMPSBYP_Pos          (12U)
#define PWR_CR4_SMPSBYP_Msk          (0x1UL << PWR_CR4_SMPSBYP_Pos)            /*!< 0x00001000 */
#define PWR_CR4_SMPSBYP              PWR_CR4_SMPSBYP_Msk                       /*!< SMPS Bypass mode */
#define PWR_CR4_EXTSMPSEN_Pos        (13U)
#define PWR_CR4_EXTSMPSEN_Msk        (0x1UL << PWR_CR4_EXTSMPSEN_Pos)          /*!< 0x00002000 */
#define PWR_CR4_EXTSMPSEN            PWR_CR4_EXTSMPSEN_Msk                     /*!< External SMPS mode */
#define PWR_CR4_SMPSFSTEN_Pos        (14U)
#define PWR_CR4_SMPSFSTEN_Msk        (0x1UL << PWR_CR4_SMPSFSTEN_Pos)          /*!< 0x00004000 */
#define PWR_CR4_SMPSFSTEN            PWR_CR4_SMPSFSTEN_Msk                     /*!< SMPS fast soft start */
#define PWR_CR4_SMPSLPEN_Pos         (15U)
#define PWR_CR4_SMPSLPEN_Msk         (0x1UL << PWR_CR4_SMPSLPEN_Pos)           /*!< 0x00008000 */
#define PWR_CR4_SMPSLPEN             PWR_CR4_SMPSLPEN_Msk                      /*!< SMPS low-power mode */

/********************  Bit definition for PWR_SR1 register  ********************/
#define PWR_SR1_WUF_Pos              (0U)
#define PWR_SR1_WUF_Msk              (0x1FUL << PWR_SR1_WUF_Pos)               /*!< 0x0000001F */
#define PWR_SR1_WUF                  PWR_SR1_WUF_Msk                           /*!< Wake-up Flags */
#define PWR_SR1_WUF1_Pos             (0U)
#define PWR_SR1_WUF1_Msk             (0x1UL << PWR_SR1_WUF1_Pos)               /*!< 0x00000001 */
#define PWR_SR1_WUF1                 PWR_SR1_WUF1_Msk                          /*!< Wake-up Flag 1 */
#define PWR_SR1_WUF2_Pos             (1U)
#define PWR_SR1_WUF2_Msk             (0x1UL << PWR_SR1_WUF2_Pos)               /*!< 0x00000002 */
#define PWR_SR1_WUF2                 PWR_SR1_WUF2_Msk                          /*!< Wake-up Flag 2 */
#define PWR_SR1_WUF3_Pos             (2U)
#define PWR_SR1_WUF3_Msk             (0x1UL << PWR_SR1_WUF3_Pos)               /*!< 0x00000004 */
#define PWR_SR1_WUF3                 PWR_SR1_WUF3_Msk                          /*!< Wake-up Flag 3 */
#define PWR_SR1_WUF4_Pos             (3U)
#define PWR_SR1_WUF4_Msk             (0x1UL << PWR_SR1_WUF4_Pos)               /*!< 0x00000008 */
#define PWR_SR1_WUF4                 PWR_SR1_WUF4_Msk                          /*!< Wake-up Flag 4 */
#define PWR_SR1_WUF5_Pos             (4U)
#define PWR_SR1_WUF5_Msk             (0x1UL << PWR_SR1_WUF5_Pos)               /*!< 0x00000010 */
#define PWR_SR1_WUF5                 PWR_SR1_WUF5_Msk                          /*!< Wake-up Flag 5 */
#define PWR_SR1_SBF_Pos              (8U)
#define PWR_SR1_SBF_Msk              (0x1UL << PWR_SR1_SBF_Pos)                /*!< 0x00000100 */
#define PWR_SR1_SBF                  PWR_SR1_SBF_Msk                           /*!< Stand-By Flag */
#define PWR_SR1_SMPSBYPRDY_Pos       (12U)
#define PWR_SR1_SMPSBYPRDY_Msk       (0x1UL << PWR_SR1_SMPSBYPRDY_Pos)         /*!< 0x00001000 */
#define PWR_SR1_SMPSBYPRDY           PWR_SR1_SMPSBYPRDY_Msk                    /*!< SMPS Bypass ready */
#define PWR_SR1_EXTSMPSRDY_Pos       (13U)
#define PWR_SR1_EXTSMPSRDY_Msk       (0x1UL << PWR_SR1_EXTSMPSRDY_Pos)         /*!< 0x00002000 */
#define PWR_SR1_EXTSMPSRDY           PWR_SR1_EXTSMPSRDY_Msk                    /*!< External SMPS mode ready */
#define PWR_SR1_SMPSHPRDY_Pos        (15U)
#define PWR_SR1_SMPSHPRDY_Msk        (0x1UL << PWR_SR1_SMPSHPRDY_Pos)          /*!< 0x00008000 */
#define PWR_SR1_SMPSHPRDY            PWR_SR1_SMPSHPRDY_Msk                     /*!< SMPS High-power mode ready */

