MikroElektronika/core_packages/ARM/gcc_clang/def/stm/STM32L562QE/mcu.h
/********************  Bit definition for PWR_PUCRH register  ********************/
#define PWR_PUCRH_PU0_Pos            (0U)
#define PWR_PUCRH_PU0_Msk            (0x1UL << PWR_PUCRH_PU0_Pos)              /*!< 0x00000001 */
#define PWR_PUCRH_PU0                PWR_PUCRH_PU0_Msk                         /*!< Port PH0 Pull-Up set  */
#define PWR_PUCRH_PU1_Pos            (1U)
#define PWR_PUCRH_PU1_Msk            (0x1UL << PWR_PUCRH_PU1_Pos)              /*!< 0x00000002 */
#define PWR_PUCRH_PU1                PWR_PUCRH_PU1_Msk                         /*!< Port PH1 Pull-Up set  */
#define PWR_PUCRH_PU2_Pos            (2U)
#define PWR_PUCRH_PU2_Msk            (0x1UL << PWR_PUCRH_PU2_Pos)              /*!< 0x00000004 */
#define PWR_PUCRH_PU2                PWR_PUCRH_PU2_Msk                         /*!< Port PH2 Pull-Up set  */
#define PWR_PUCRH_PU3_Pos            (3U)
#define PWR_PUCRH_PU3_Msk            (0x1UL << PWR_PUCRH_PU3_Pos)              /*!< 0x00000008 */
#define PWR_PUCRH_PU3                PWR_PUCRH_PU3_Msk                         /*!< Port PH3 Pull-Up set  */

/********************  Bit definition for PWR_PDCRH register  ********************/
#define PWR_PDCRH_PD0_Pos            (0U)
#define PWR_PDCRH_PD0_Msk            (0x1UL << PWR_PDCRH_PD0_Pos)              /*!< 0x00000001 */
#define PWR_PDCRH_PD0                PWR_PDCRH_PD0_Msk                         /*!< Port PH0 Pull-Down set  */
#define PWR_PDCRH_PD1_Pos            (1U)
#define PWR_PDCRH_PD1_Msk            (0x1UL << PWR_PDCRH_PD1_Pos)              /*!< 0x00000002 */
#define PWR_PDCRH_PD1                PWR_PDCRH_PD1_Msk                         /*!< Port PH1 Pull-Down set  */
#define PWR_PDCRH_PD2_Pos            (2U)
#define PWR_PDCRH_PD2_Msk            (0x1UL << PWR_PDCRH_PD2_Pos)              /*!< 0x00000004 */
#define PWR_PDCRH_PD2                PWR_PDCRH_PD2_Msk                         /*!< Port PH2 Pull-Down set  */
#define PWR_PDCRH_PD3_Pos            (3U)
#define PWR_PDCRH_PD3_Msk            (0x1UL << PWR_PDCRH_PD3_Pos)              /*!< 0x00000008 */
#define PWR_PDCRH_PD3                PWR_PDCRH_PD3_Msk                         /*!< Port PH3 Pull-Down set  */

/********************  Bit definition for PWR_SECCFGR register  ******************/
#define PWR_SECCFGR_WUPSEC_Pos       (0U)
#define PWR_SECCFGR_WUPSEC_Msk       (0x1FUL << PWR_SECCFGR_WUPSEC_Pos)        /*!< 0x0000001F */
#define PWR_SECCFGR_WUPSEC           PWR_SECCFGR_WUPSEC_Msk                    /*!< Secure Mode Wake-Up Pins  */
#define PWR_SECCFGR_WUP1SEC_Pos      (0U)
#define PWR_SECCFGR_WUP1SEC_Msk      (0x1UL << PWR_SECCFGR_WUP1SEC_Pos)        /*!< 0x00000001 */
#define PWR_SECCFGR_WUP1SEC          PWR_SECCFGR_WUP1SEC_Msk                   /*!< Secure Mode Wake-Up Pin 1 */
#define PWR_SECCFGR_WUP2SEC_Pos      (1U)
#define PWR_SECCFGR_WUP2SEC_Msk      (0x1UL << PWR_SECCFGR_WUP2SEC_Pos)        /*!< 0x00000002 */
#define PWR_SECCFGR_WUP2SEC          PWR_SECCFGR_WUP2SEC_Msk                   /*!< Secure Mode Wake-Up Pin 2 */
#define PWR_SECCFGR_WUP3SEC_Pos      (2U)
#define PWR_SECCFGR_WUP3SEC_Msk      (0x1UL << PWR_SECCFGR_WUP3SEC_Pos)        /*!< 0x00000004 */
#define PWR_SECCFGR_WUP3SEC          PWR_SECCFGR_WUP3SEC_Msk                   /*!< Secure Mode Wake-Up Pin 3 */
#define PWR_SECCFGR_WUP4SEC_Pos      (3U)
#define PWR_SECCFGR_WUP4SEC_Msk      (0x1UL << PWR_SECCFGR_WUP4SEC_Pos)        /*!< 0x00000008 */
#define PWR_SECCFGR_WUP4SEC          PWR_SECCFGR_WUP4SEC_Msk                   /*!< Secure Mode Wake-Up Pin 4 */
#define PWR_SECCFGR_WUP5SEC_Pos      (4U)
#define PWR_SECCFGR_WUP5SEC_Msk      (0x1UL << PWR_SECCFGR_WUP5SEC_Pos)        /*!< 0x00000010 */
#define PWR_SECCFGR_WUP5SEC          PWR_SECCFGR_WUP5SEC_Msk                   /*!< Secure Mode Wake-Up Pin 5 */
#define PWR_SECCFGR_LPMSEC_Pos       (8U)
#define PWR_SECCFGR_LPMSEC_Msk       (0x1UL << PWR_SECCFGR_LPMSEC_Pos)         /*!< 0x00000100 */
#define PWR_SECCFGR_LPMSEC           PWR_SECCFGR_LPMSEC_Msk                    /*!< Secure Mode Low Power Modes */
#define PWR_SECCFGR_VDMSEC_Pos       (9U)
#define PWR_SECCFGR_VDMSEC_Msk       (0x1UL << PWR_SECCFGR_VDMSEC_Pos)         /*!< 0x00000200 */
#define PWR_SECCFGR_VDMSEC           PWR_SECCFGR_VDMSEC_Msk                    /*!< Secure Mode Voltage Detection and Monitoring */
#define PWR_SECCFGR_VBSEC_Pos        (10U)
#define PWR_SECCFGR_VBSEC_Msk        (0x1UL << PWR_SECCFGR_VBSEC_Pos)          /*!< 0x00000400 */
#define PWR_SECCFGR_VBSEC            PWR_SECCFGR_VBSEC_Msk                     /*!< Secure Mode VBAT */
#define PWR_SECCFGR_APCSEC_Pos       (11U)
#define PWR_SECCFGR_APCSEC_Msk       (0x1UL << PWR_SECCFGR_APCSEC_Pos)         /*!< 0x00000800 */
#define PWR_SECCFGR_APCSEC           PWR_SECCFGR_APCSEC_Msk                    /*!< Secure Mode Pull-Up/Down Control */

/********************  Bit definition for PWR_PRIVCFGR register  *****************/
#define PWR_PRIVCFGR_PRIV_Pos        (0U)
#define PWR_PRIVCFGR_PRIV_Msk        (0x1UL << PWR_PRIVCFGR_PRIV_Pos)          /*!< 0x00000001 */
#define PWR_PRIVCFGR_PRIV            PWR_PRIVCFGR_PRIV_Msk                     /*!< Privileged access protection */

/******************************************************************************/
/*                                                                            */
/*                         Reset and Clock Control                            */
/*                                                                            */
/******************************************************************************/
#define RCC_MAX_FREQUENCY           110000000U         /*!< Max frequency of family in Hz*/
#define RCC_MAX_FREQUENCY_MHZ       110U               /*!< Max frequency of family in MHz*/

/********************  Bit definition for RCC_CR register  ********************/
#define RCC_CR_MSION_Pos                     (0U)
#define RCC_CR_MSION_Msk                     (0x1UL << RCC_CR_MSION_Pos)       /*!< 0x00000001 */
#define RCC_CR_MSION                         RCC_CR_MSION_Msk                  /*!< Internal Multi Speed oscillator (MSI) clock enable */
#define RCC_CR_MSIRDY_Pos                    (1U)
#define RCC_CR_MSIRDY_Msk                    (0x1UL << RCC_CR_MSIRDY_Pos)      /*!< 0x00000002 */
#define RCC_CR_MSIRDY                        RCC_CR_MSIRDY_Msk                 /*!< Internal Multi Speed oscillator (MSI) clock ready flag */
#define RCC_CR_MSIPLLEN_Pos                  (2U)
#define RCC_CR_MSIPLLEN_Msk                  (0x1UL << RCC_CR_MSIPLLEN_Pos)    /*!< 0x00000004 */
#define RCC_CR_MSIPLLEN                      RCC_CR_MSIPLLEN_Msk               /*!< Internal Multi Speed oscillator (MSI) PLL enable */
#define RCC_CR_MSIRGSEL_Pos                  (3U)
#define RCC_CR_MSIRGSEL_Msk                  (0x1UL << RCC_CR_MSIRGSEL_Pos)    /*!< 0x00000008 */
#define RCC_CR_MSIRGSEL                      RCC_CR_MSIRGSEL_Msk               /*!< Internal Multi Speed oscillator (MSI) range selection */

/*!< MSIRANGE configuration : 12 frequency ranges available */
#define RCC_CR_MSIRANGE_Pos                  (4U)
#define RCC_CR_MSIRANGE_Msk                  (0xFUL << RCC_CR_MSIRANGE_Pos)    /*!< 0x000000F0 */
#define RCC_CR_MSIRANGE                      RCC_CR_MSIRANGE_Msk               /*!< Internal Multi Speed oscillator (MSI) clock Range */
#define RCC_CR_MSIRANGE_0                    (0x1UL << RCC_CR_MSIRANGE_Pos)    /*!< 0x00000010 */
#define RCC_CR_MSIRANGE_1                    (0x2UL << RCC_CR_MSIRANGE_Pos)    /*!< 0x00000020 */
#define RCC_CR_MSIRANGE_2                    (0x4UL << RCC_CR_MSIRANGE_Pos)    /*!< 0x00000040 */
#define RCC_CR_MSIRANGE_3                    (0x8UL << RCC_CR_MSIRANGE_Pos)    /*!< 0x00000080 */

#define RCC_CR_HSION_Pos                     (8U)
#define RCC_CR_HSION_Msk                     (0x1UL << RCC_CR_HSION_Pos)       /*!< 0x00000100 */
#define RCC_CR_HSION                         RCC_CR_HSION_Msk                  /*!< Internal High Speed oscillator (HSI16) clock enable */
#define RCC_CR_HSIKERON_Pos                  (9U)
#define RCC_CR_HSIKERON_Msk                  (0x1UL << RCC_CR_HSIKERON_Pos)    /*!< 0x00000200 */
#define RCC_CR_HSIKERON                      RCC_CR_HSIKERON_Msk               /*!< Internal High Speed oscillator (HSI16) clock enable for some IPs Kernel */
#define RCC_CR_HSIRDY_Pos                    (10U)
#define RCC_CR_HSIRDY_Msk                    (0x1UL << RCC_CR_HSIRDY_Pos)      /*!< 0x00000400 */
#define RCC_CR_HSIRDY                        RCC_CR_HSIRDY_Msk                 /*!< Internal High Speed oscillator (HSI16) clock ready flag */
#define RCC_CR_HSIASFS_Pos                   (11U)
#define RCC_CR_HSIASFS_Msk                   (0x1UL << RCC_CR_HSIASFS_Pos)     /*!< 0x00000800 */
#define RCC_CR_HSIASFS                       RCC_CR_HSIASFS_Msk                /*!< HSI16 Automatic Start from Stop */

