MikroElektronika/core_packages/ARM/gcc_clang/def/stm/STM32L562QE/mcu.h
/*******************  Bits definition for GTZC_TZIC_SR1 register  **************/
#define GTZC_TZIC_SR1_SPI1F_Pos                 GTZC_CFGR1_SPI1_Pos
#define GTZC_TZIC_SR1_SPI1F_Msk                 GTZC_CFGR1_SPI1_Msk
#define GTZC_TZIC_SR1_TIM1F_Pos                 GTZC_CFGR1_TIM1_Pos
#define GTZC_TZIC_SR1_TIM1F_Msk                 GTZC_CFGR1_TIM1_Msk
#define GTZC_TZIC_SR1_COMPF_Pos                 GTZC_CFGR1_COMP_Pos
#define GTZC_TZIC_SR1_COMPF_Msk                 GTZC_CFGR1_COMP_Msk
#define GTZC_TZIC_SR1_VREFBUFF_Pos              GTZC_CFGR1_VREFBUF_Pos
#define GTZC_TZIC_SR1_VREFBUFF_Msk              GTZC_CFGR1_VREFBUF_Msk
#define GTZC_TZIC_SR1_UCPD1F_Pos                GTZC_CFGR1_UCPD1_Pos
#define GTZC_TZIC_SR1_UCPD1F_Msk                GTZC_CFGR1_UCPD1_Msk
#define GTZC_TZIC_SR1_USBFSF_Pos                GTZC_CFGR1_USBFS_Pos
#define GTZC_TZIC_SR1_USBFSF_Msk                GTZC_CFGR1_USBFS_Msk
#define GTZC_TZIC_SR1_FDCAN1F_Pos               GTZC_CFGR1_FDCAN1_Pos
#define GTZC_TZIC_SR1_FDCAN1F_Msk               GTZC_CFGR1_FDCAN1_Msk
#define GTZC_TZIC_SR1_LPTIM3F_Pos               GTZC_CFGR1_LPTIM3_Pos
#define GTZC_TZIC_SR1_LPTIM3F_Msk               GTZC_CFGR1_LPTIM3_Msk
#define GTZC_TZIC_SR1_LPTIM2F_Pos               GTZC_CFGR1_LPTIM2_Pos
#define GTZC_TZIC_SR1_LPTIM2F_Msk               GTZC_CFGR1_LPTIM2_Msk
#define GTZC_TZIC_SR1_I2C4F_Pos                 GTZC_CFGR1_I2C4_Pos
#define GTZC_TZIC_SR1_I2C4F_Msk                 GTZC_CFGR1_I2C4_Msk
#define GTZC_TZIC_SR1_LPUART1F_Pos              GTZC_CFGR1_LPUART1_Pos
#define GTZC_TZIC_SR1_LPUART1F_Msk              GTZC_CFGR1_LPUART1_Msk
#define GTZC_TZIC_SR1_LPTIM1F_Pos               GTZC_CFGR1_LPTIM1_Pos
#define GTZC_TZIC_SR1_LPTIM1F_Msk               GTZC_CFGR1_LPTIM1_Msk
#define GTZC_TZIC_SR1_OPAMPF_Pos                GTZC_CFGR1_OPAMP_Pos
#define GTZC_TZIC_SR1_OPAMPF_Msk                GTZC_CFGR1_OPAMP_Msk
#define GTZC_TZIC_SR1_DAC1F_Pos                 GTZC_CFGR1_DAC1_Pos
#define GTZC_TZIC_SR1_DAC1F_Msk                 GTZC_CFGR1_DAC1_Msk
#define GTZC_TZIC_SR1_CRSF_Pos                  GTZC_CFGR1_CRS_Pos
#define GTZC_TZIC_SR1_CRSF_Msk                  GTZC_CFGR1_CRS_Msk
#define GTZC_TZIC_SR1_I2C3F_Pos                 GTZC_CFGR1_I2C3_Pos
#define GTZC_TZIC_SR1_I2C3F_Msk                 GTZC_CFGR1_I2C3_Msk
#define GTZC_TZIC_SR1_I2C2F_Pos                 GTZC_CFGR1_I2C2_Pos
#define GTZC_TZIC_SR1_I2C2F_Msk                 GTZC_CFGR1_I2C2_Msk
#define GTZC_TZIC_SR1_I2C1F_Pos                 GTZC_CFGR1_I2C1_Pos
#define GTZC_TZIC_SR1_I2C1F_Msk                 GTZC_CFGR1_I2C1_Msk
#define GTZC_TZIC_SR1_UART5F_Pos                GTZC_CFGR1_UART5_Pos
#define GTZC_TZIC_SR1_UART5F_Msk                GTZC_CFGR1_UART5_Msk
#define GTZC_TZIC_SR1_UART4F_Pos                GTZC_CFGR1_UART4_Pos
#define GTZC_TZIC_SR1_UART4F_Msk                GTZC_CFGR1_UART4_Msk
#define GTZC_TZIC_SR1_USART3F_Pos               GTZC_CFGR1_USART3_Pos
#define GTZC_TZIC_SR1_USART3F_Msk               GTZC_CFGR1_USART3_Msk
#define GTZC_TZIC_SR1_USART2F_Pos               GTZC_CFGR1_USART2_Pos
#define GTZC_TZIC_SR1_USART2F_Msk               GTZC_CFGR1_USART2_Msk
#define GTZC_TZIC_SR1_SPI3F_Pos                 GTZC_CFGR1_SPI3_Pos
#define GTZC_TZIC_SR1_SPI3F_Msk                 GTZC_CFGR1_SPI3_Msk
#define GTZC_TZIC_SR1_SPI2F_Pos                 GTZC_CFGR1_SPI2_Pos
#define GTZC_TZIC_SR1_SPI2F_Msk                 GTZC_CFGR1_SPI2_Msk
#define GTZC_TZIC_SR1_IWDGF_Pos                 GTZC_CFGR1_IWDG_Pos
#define GTZC_TZIC_SR1_IWDGF_Msk                 GTZC_CFGR1_IWDG_Msk
#define GTZC_TZIC_SR1_WWDGF_Pos                 GTZC_CFGR1_WWDG_Pos
#define GTZC_TZIC_SR1_WWDGF_Msk                 GTZC_CFGR1_WWDG_Msk
#define GTZC_TZIC_SR1_TIM7F_Pos                 GTZC_CFGR1_TIM7_Pos
#define GTZC_TZIC_SR1_TIM7F_Msk                 GTZC_CFGR1_TIM7_Msk
#define GTZC_TZIC_SR1_TIM6F_Pos                 GTZC_CFGR1_TIM6_Pos
#define GTZC_TZIC_SR1_TIM6F_Msk                 GTZC_CFGR1_TIM6_Msk
#define GTZC_TZIC_SR1_TIM5F_Pos                 GTZC_CFGR1_TIM5_Pos
#define GTZC_TZIC_SR1_TIM5F_Msk                 GTZC_CFGR1_TIM5_Msk
#define GTZC_TZIC_SR1_TIM4F_Pos                 GTZC_CFGR1_TIM4_Pos
#define GTZC_TZIC_SR1_TIM4F_Msk                 GTZC_CFGR1_TIM4_Msk
#define GTZC_TZIC_SR1_TIM3F_Pos                 GTZC_CFGR1_TIM3_Pos
#define GTZC_TZIC_SR1_TIM3F_Msk                 GTZC_CFGR1_TIM3_Msk
#define GTZC_TZIC_SR1_TIM2F_Pos                 GTZC_CFGR1_TIM2_Pos
#define GTZC_TZIC_SR1_TIM2F_Msk                 GTZC_CFGR1_TIM2_Msk

/*******************  Bits definition for GTZC_TZIC_SR2 register  **************/
#define GTZC_TZIC_SR2_OTFDEC1F_Pos              GTZC_CFGR2_OTFDEC1_Pos
#define GTZC_TZIC_SR2_OTFDEC1F_Msk              GTZC_CFGR2_OTFDEC1_Msk
#define GTZC_TZIC_SR2_EXTIF_Pos                 GTZC_CFGR2_EXTI_Pos
#define GTZC_TZIC_SR2_EXTIF_Msk                 GTZC_CFGR2_EXTI_Msk
#define GTZC_TZIC_SR2_FLASH_REGF_Pos            GTZC_CFGR2_FLASH_REG_Pos
#define GTZC_TZIC_SR2_FLASH_REGF_Msk            GTZC_CFGR2_FLASH_REG_Msk
#define GTZC_TZIC_SR2_FLASHF_Pos                GTZC_CFGR2_FLASH_Pos
#define GTZC_TZIC_SR2_FLASHF_Msk                GTZC_CFGR2_FLASH_Msk
#define GTZC_TZIC_SR2_RCCF_Pos                  GTZC_CFGR2_RCC_Pos
#define GTZC_TZIC_SR2_RCCF_Msk                  GTZC_CFGR2_RCC_Msk
#define GTZC_TZIC_SR2_DMAMUX1F_Pos              GTZC_CFGR2_DMAMUX1_Pos
#define GTZC_TZIC_SR2_DMAMUX1F_Msk              GTZC_CFGR2_DMAMUX1_Msk
#define GTZC_TZIC_SR2_DMA2F_Pos                 GTZC_CFGR2_DMA2_Pos
#define GTZC_TZIC_SR2_DMA2F_Msk                 GTZC_CFGR2_DMA2_Msk
#define GTZC_TZIC_SR2_DMA1F_Pos                 GTZC_CFGR2_DMA1_Pos
#define GTZC_TZIC_SR2_DMA1F_Msk                 GTZC_CFGR2_DMA1_Msk
#define GTZC_TZIC_SR2_SYSCFGF_Pos               GTZC_CFGR2_SYSCFG_Pos
#define GTZC_TZIC_SR2_SYSCFGF_Msk               GTZC_CFGR2_SYSCFG_Msk
#define GTZC_TZIC_SR2_PWRF_Pos                  GTZC_CFGR2_PWR_Pos
#define GTZC_TZIC_SR2_PWRF_Msk                  GTZC_CFGR2_PWR_Msk
#define GTZC_TZIC_SR2_RTCF_Pos                  GTZC_CFGR2_RTC_Pos
#define GTZC_TZIC_SR2_RTCF_Msk                  GTZC_CFGR2_RTC_Msk
#define GTZC_TZIC_SR2_OCTOSPI1_REGF_Pos         GTZC_CFGR2_OCTOSPI1_REG_Pos
#define GTZC_TZIC_SR2_OCTOSPI1_REGF_Msk         GTZC_CFGR2_OCTOSPI1_REG_Msk
#define GTZC_TZIC_SR2_FMC_REGF_Pos              GTZC_CFGR2_FMC_REG_Pos
#define GTZC_TZIC_SR2_FMC_REGF_Msk              GTZC_CFGR2_FMC_REG_Msk
#define GTZC_TZIC_SR2_SDMMC1F_Pos               GTZC_CFGR2_SDMMC1_Pos
#define GTZC_TZIC_SR2_SDMMC1F_Msk               GTZC_CFGR2_SDMMC1_Msk
#define GTZC_TZIC_SR2_PKAF_Pos                  GTZC_CFGR2_PKA_Pos
#define GTZC_TZIC_SR2_PKAF_Msk                  GTZC_CFGR2_PKA_Msk
#define GTZC_TZIC_SR2_RNGF_Pos                  GTZC_CFGR2_RNG_Pos
#define GTZC_TZIC_SR2_RNGF_Msk                  GTZC_CFGR2_RNG_Msk
#define GTZC_TZIC_SR2_HASHF_Pos                 GTZC_CFGR2_HASH_Pos
#define GTZC_TZIC_SR2_HASHF_Msk                 GTZC_CFGR2_HASH_Msk
#define GTZC_TZIC_SR2_AESF_Pos                  GTZC_CFGR2_AES_Pos
#define GTZC_TZIC_SR2_AESF_Msk                  GTZC_CFGR2_AES_Msk
#define GTZC_TZIC_SR2_ADCF_Pos                  GTZC_CFGR2_ADC_Pos
#define GTZC_TZIC_SR2_ADCF_Msk                  GTZC_CFGR2_ADC_Msk
#define GTZC_TZIC_SR2_ICACHE_REGF_Pos           GTZC_CFGR2_ICACHE_REG_Pos
#define GTZC_TZIC_SR2_ICACHE_REGF_Msk           GTZC_CFGR2_ICACHE_REG_Msk
#define GTZC_TZIC_SR2_TSCF_Pos                  GTZC_CFGR2_TSC_Pos
#define GTZC_TZIC_SR2_TSCF_Msk                  GTZC_CFGR2_TSC_Msk
#define GTZC_TZIC_SR2_CRCF_Pos                  GTZC_CFGR2_CRC_Pos
#define GTZC_TZIC_SR2_CRCF_Msk                  GTZC_CFGR2_CRC_Msk
#define GTZC_TZIC_SR2_DFSDM1F_Pos               GTZC_CFGR2_DFSDM1_Pos
#define GTZC_TZIC_SR2_DFSDM1F_Msk               GTZC_CFGR2_DFSDM1_Msk
#define GTZC_TZIC_SR2_SAI2F_Pos                 GTZC_CFGR2_SAI2_Pos
#define GTZC_TZIC_SR2_SAI2F_Msk                 GTZC_CFGR2_SAI2_Msk
#define GTZC_TZIC_SR2_SAI1F_Pos                 GTZC_CFGR2_SAI1_Pos
#define GTZC_TZIC_SR2_SAI1F_Msk                 GTZC_CFGR2_SAI1_Msk
#define GTZC_TZIC_SR2_TIM17F_Pos                GTZC_CFGR2_TIM17_Pos
#define GTZC_TZIC_SR2_TIM17F_Msk                GTZC_CFGR2_TIM17_Msk
#define GTZC_TZIC_SR2_TIM16F_Pos                GTZC_CFGR2_TIM16_Pos
#define GTZC_TZIC_SR2_TIM16F_Msk                GTZC_CFGR2_TIM16_Msk
#define GTZC_TZIC_SR2_TIM15F_Pos                GTZC_CFGR2_TIM15_Pos
#define GTZC_TZIC_SR2_TIM15F_Msk                GTZC_CFGR2_TIM15_Msk
#define GTZC_TZIC_SR2_USART1F_Pos               GTZC_CFGR2_USART1_Pos
#define GTZC_TZIC_SR2_USART1F_Msk               GTZC_CFGR2_USART1_Msk
#define GTZC_TZIC_SR2_TIM8F_Pos                 GTZC_CFGR2_TIM8_Pos
#define GTZC_TZIC_SR2_TIM8F_Msk                 GTZC_CFGR2_TIM8_Msk

/*******************  Bits definition for GTZC_TZIC_SR3 register  **************/
#define GTZC_TZIC_SR3_MPCBB2_REGF_Pos           GTZC_CFGR3_MPCBB2_REG_Pos
#define GTZC_TZIC_SR3_MPCBB2_REGF_Msk           GTZC_CFGR3_MPCBB2_REG_Msk
#define GTZC_TZIC_SR3_SRAM2F_Pos                GTZC_CFGR3_SRAM2_Pos
#define GTZC_TZIC_SR3_SRAM2F_Msk                GTZC_CFGR3_SRAM2_Msk
#define GTZC_TZIC_SR3_MPCBB1_REGF_Pos           GTZC_CFGR3_MPCBB1_REG_Pos
#define GTZC_TZIC_SR3_MPCBB1_REGF_Msk           GTZC_CFGR3_MPCBB1_REG_Msk
#define GTZC_TZIC_SR3_SRAM1F_Pos                GTZC_CFGR3_SRAM1_Pos
#define GTZC_TZIC_SR3_SRAM1F_Msk                GTZC_CFGR3_SRAM1_Msk
#define GTZC_TZIC_SR3_OCTOSPI1_MEMF_Pos         GTZC_CFGR3_OCTOSPI1_MEM_Pos
#define GTZC_TZIC_SR3_OCTOSPI1_MEMF_Msk         GTZC_CFGR3_OCTOSPI1_MEM_Msk
#define GTZC_TZIC_SR3_FMC_MEMF_Pos              GTZC_CFGR3_FMC_MEM_Pos
#define GTZC_TZIC_SR3_FMC_MEMF_Msk              GTZC_CFGR3_FMC_MEM_Msk
#define GTZC_TZIC_SR3_TZICF_Pos                 GTZC_CFGR3_TZIC_Pos
#define GTZC_TZIC_SR3_TZICF_Msk                 GTZC_CFGR3_TZIC_Msk
#define GTZC_TZIC_SR3_TZSCF_Pos                 GTZC_CFGR3_TZSC_Pos
#define GTZC_TZIC_SR3_TZSCF_Msk                 GTZC_CFGR3_TZSC_Msk

/******************  Bits definition for GTZC_TZIC_FCR1 register  ****************/
#define GTZC_TZIC_FCR1_SPI1FC_Pos               GTZC_CFGR1_SPI1_Pos
#define GTZC_TZIC_FCR1_SPI1FC_Msk               GTZC_CFGR1_SPI1_Msk
#define GTZC_TZIC_FCR1_TIM1FC_Pos               GTZC_CFGR1_TIM1_Pos
#define GTZC_TZIC_FCR1_TIM1FC_Msk               GTZC_CFGR1_TIM1_Msk
#define GTZC_TZIC_FCR1_COMPFC_Pos               GTZC_CFGR1_COMP_Pos
#define GTZC_TZIC_FCR1_COMPFC_Msk               GTZC_CFGR1_COMP_Msk
#define GTZC_TZIC_FCR1_VREFBUFFC_Pos            GTZC_CFGR1_VREFBUF_Pos
#define GTZC_TZIC_FCR1_VREFBUFFC_Msk            GTZC_CFGR1_VREFBUF_Msk
#define GTZC_TZIC_FCR1_UCPD1FC_Pos              GTZC_CFGR1_UCPD1_Pos
#define GTZC_TZIC_FCR1_UCPD1FC_Msk              GTZC_CFGR1_UCPD1_Msk
#define GTZC_TZIC_FCR1_USBFSFC_Pos              GTZC_CFGR1_USBFS_Pos
#define GTZC_TZIC_FCR1_USBFSFC_Msk              GTZC_CFGR1_USBFS_Msk
#define GTZC_TZIC_FCR1_FDCAN1FC_Pos             GTZC_CFGR1_FDCAN1_Pos
#define GTZC_TZIC_FCR1_FDCAN1FC_Msk             GTZC_CFGR1_FDCAN1_Msk
#define GTZC_TZIC_FCR1_LPTIM3FC_Pos             GTZC_CFGR1_LPTIM3_Pos
#define GTZC_TZIC_FCR1_LPTIM3FC_Msk             GTZC_CFGR1_LPTIM3_Msk
#define GTZC_TZIC_FCR1_LPTIM2FC_Pos             GTZC_CFGR1_LPTIM2_Pos
#define GTZC_TZIC_FCR1_LPTIM2FC_Msk             GTZC_CFGR1_LPTIM2_Msk
#define GTZC_TZIC_FCR1_I2C4FC_Pos               GTZC_CFGR1_I2C4_Pos
#define GTZC_TZIC_FCR1_I2C4FC_Msk               GTZC_CFGR1_I2C4_Msk
#define GTZC_TZIC_FCR1_LPUART1FC_Pos            GTZC_CFGR1_LPUART1_Pos
#define GTZC_TZIC_FCR1_LPUART1FC_Msk            GTZC_CFGR1_LPUART1_Msk
#define GTZC_TZIC_FCR1_LPTIM1FC_Pos             GTZC_CFGR1_LPTIM1_Pos
#define GTZC_TZIC_FCR1_LPTIM1FC_Msk             GTZC_CFGR1_LPTIM1_Msk
#define GTZC_TZIC_FCR1_OPAMPFC_Pos              GTZC_CFGR1_OPAMP_Pos
#define GTZC_TZIC_FCR1_OPAMPFC_Msk              GTZC_CFGR1_OPAMP_Msk
#define GTZC_TZIC_FCR1_DAC1FC_Pos               GTZC_CFGR1_DAC1_Pos
#define GTZC_TZIC_FCR1_DAC1FC_Msk               GTZC_CFGR1_DAC1_Msk
#define GTZC_TZIC_FCR1_CRSFC_Pos                GTZC_CFGR1_CRS_Pos
#define GTZC_TZIC_FCR1_CRSFC_Msk                GTZC_CFGR1_CRS_Msk
#define GTZC_TZIC_FCR1_I2C3FC_Pos               GTZC_CFGR1_I2C3_Pos
#define GTZC_TZIC_FCR1_I2C3FC_Msk               GTZC_CFGR1_I2C3_Msk
#define GTZC_TZIC_FCR1_I2C2FC_Pos               GTZC_CFGR1_I2C2_Pos
#define GTZC_TZIC_FCR1_I2C2FC_Msk               GTZC_CFGR1_I2C2_Msk
#define GTZC_TZIC_FCR1_I2C1FC_Pos               GTZC_CFGR1_I2C1_Pos
#define GTZC_TZIC_FCR1_I2C1FC_Msk               GTZC_CFGR1_I2C1_Msk
#define GTZC_TZIC_FCR1_UART5FC_Pos              GTZC_CFGR1_UART5_Pos
#define GTZC_TZIC_FCR1_UART5FC_Msk              GTZC_CFGR1_UART5_Msk
#define GTZC_TZIC_FCR1_UART4FC_Pos              GTZC_CFGR1_UART4_Pos
#define GTZC_TZIC_FCR1_UART4FC_Msk              GTZC_CFGR1_UART4_Msk
#define GTZC_TZIC_FCR1_USART3FC_Pos             GTZC_CFGR1_USART3_Pos
#define GTZC_TZIC_FCR1_USART3FC_Msk             GTZC_CFGR1_USART3_Msk
#define GTZC_TZIC_FCR1_USART2FC_Pos             GTZC_CFGR1_USART2_Pos
#define GTZC_TZIC_FCR1_USART2FC_Msk             GTZC_CFGR1_USART2_Msk
#define GTZC_TZIC_FCR1_SPI3FC_Pos               GTZC_CFGR1_SPI3_Pos
#define GTZC_TZIC_FCR1_SPI3FC_Msk               GTZC_CFGR1_SPI3_Msk
#define GTZC_TZIC_FCR1_SPI2FC_Pos               GTZC_CFGR1_SPI2_Pos
#define GTZC_TZIC_FCR1_SPI2FC_Msk               GTZC_CFGR1_SPI2_Msk
#define GTZC_TZIC_FCR1_IWDGFC_Pos               GTZC_CFGR1_IWDG_Pos
#define GTZC_TZIC_FCR1_IWDGFC_Msk               GTZC_CFGR1_IWDG_Msk
#define GTZC_TZIC_FCR1_WWDGFC_Pos               GTZC_CFGR1_WWDG_Pos
#define GTZC_TZIC_FCR1_WWDGFC_Msk               GTZC_CFGR1_WWDG_Msk
#define GTZC_TZIC_FCR1_TIM7FC_Pos               GTZC_CFGR1_TIM7_Pos
#define GTZC_TZIC_FCR1_TIM7FC_Msk               GTZC_CFGR1_TIM7_Msk
#define GTZC_TZIC_FCR1_TIM6FC_Pos               GTZC_CFGR1_TIM6_Pos
#define GTZC_TZIC_FCR1_TIM6FC_Msk               GTZC_CFGR1_TIM6_Msk
#define GTZC_TZIC_FCR1_TIM5FC_Pos               GTZC_CFGR1_TIM5_Pos
#define GTZC_TZIC_FCR1_TIM5FC_Msk               GTZC_CFGR1_TIM5_Msk
#define GTZC_TZIC_FCR1_TIM4FC_Pos               GTZC_CFGR1_TIM4_Pos
#define GTZC_TZIC_FCR1_TIM4FC_Msk               GTZC_CFGR1_TIM4_Msk
#define GTZC_TZIC_FCR1_TIM3FC_Pos               GTZC_CFGR1_TIM3_Pos
#define GTZC_TZIC_FCR1_TIM3FC_Msk               GTZC_CFGR1_TIM3_Msk
#define GTZC_TZIC_FCR1_TIM2FC_Pos               GTZC_CFGR1_TIM2_Pos
#define GTZC_TZIC_FCR1_TIM2FC_Msk               GTZC_CFGR1_TIM2_Msk

/******************  Bits definition for GTZC_TZIC_FCR2 register  ****************/
#define GTZC_TZIC_FCR2_OTFDEC1FC_Pos            GTZC_CFGR2_OTFDEC1_Pos
#define GTZC_TZIC_FCR2_OTFDEC1FC_Msk            GTZC_CFGR2_OTFDEC1_Msk
#define GTZC_TZIC_FCR2_EXTIFC_Pos               GTZC_CFGR2_EXTI_Pos
#define GTZC_TZIC_FCR2_EXTIFC_Msk               GTZC_CFGR2_EXTI_Msk
#define GTZC_TZIC_FCR2_FLASH_REGFC_Pos          GTZC_CFGR2_FLASH_REG_Pos
#define GTZC_TZIC_FCR2_FLASH_REGFC_Msk          GTZC_CFGR2_FLASH_REG_Msk
#define GTZC_TZIC_FCR2_FLASHFC_Pos              GTZC_CFGR2_FLASH_Pos
#define GTZC_TZIC_FCR2_FLASHFC_Msk              GTZC_CFGR2_FLASH_Msk
#define GTZC_TZIC_FCR2_RCCFC_Pos                GTZC_CFGR2_RCC_Pos
#define GTZC_TZIC_FCR2_RCCFC_Msk                GTZC_CFGR2_RCC_Msk
#define GTZC_TZIC_FCR2_DMAMUX1FC_Pos            GTZC_CFGR2_DMAMUX1_Pos
#define GTZC_TZIC_FCR2_DMAMUX1FC_Msk            GTZC_CFGR2_DMAMUX1_Msk
#define GTZC_TZIC_FCR2_DMA2FC_Pos               GTZC_CFGR2_DMA2_Pos
#define GTZC_TZIC_FCR2_DMA2FC_Msk               GTZC_CFGR2_DMA2_Msk
#define GTZC_TZIC_FCR2_DMA1FC_Pos               GTZC_CFGR2_DMA1_Pos
#define GTZC_TZIC_FCR2_DMA1FC_Msk               GTZC_CFGR2_DMA1_Msk
#define GTZC_TZIC_FCR2_SYSCFGFC_Pos             GTZC_CFGR2_SYSCFG_Pos
#define GTZC_TZIC_FCR2_SYSCFGFC_Msk             GTZC_CFGR2_SYSCFG_Msk
#define GTZC_TZIC_FCR2_PWRFC_Pos                GTZC_CFGR2_PWR_Pos
#define GTZC_TZIC_FCR2_PWRFC_Msk                GTZC_CFGR2_PWR_Msk
#define GTZC_TZIC_FCR2_RTCFC_Pos                GTZC_CFGR2_RTC_Pos
#define GTZC_TZIC_FCR2_RTCFC_Msk                GTZC_CFGR2_RTC_Msk
#define GTZC_TZIC_FCR2_OCTOSPI1_REGFC_Pos       GTZC_CFGR2_OCTOSPI1_REG_Pos
#define GTZC_TZIC_FCR2_OCTOSPI1_REGFC_Msk       GTZC_CFGR2_OCTOSPI1_REG_Msk
#define GTZC_TZIC_FCR2_FMC_REGFC_Pos            GTZC_CFGR2_FMC_REG_Pos
#define GTZC_TZIC_FCR2_FMC_REGFC_Msk            GTZC_CFGR2_FMC_REG_Msk
#define GTZC_TZIC_FCR2_SDMMC1FC_Pos             GTZC_CFGR2_SDMMC1_Pos
#define GTZC_TZIC_FCR2_SDMMC1FC_Msk             GTZC_CFGR2_SDMMC1_Msk
#define GTZC_TZIC_FCR2_PKAFC_Pos                GTZC_CFGR2_PKA_Pos
#define GTZC_TZIC_FCR2_PKAFC_Msk                GTZC_CFGR2_PKA_Msk
#define GTZC_TZIC_FCR2_RNGFC_Pos                GTZC_CFGR2_RNG_Pos
#define GTZC_TZIC_FCR2_RNGFC_Msk                GTZC_CFGR2_RNG_Msk
#define GTZC_TZIC_FCR2_HASHFC_Pos               GTZC_CFGR2_HASH_Pos
#define GTZC_TZIC_FCR2_HASHFC_Msk               GTZC_CFGR2_HASH_Msk
#define GTZC_TZIC_FCR2_AESFC_Pos                GTZC_CFGR2_AES_Pos
#define GTZC_TZIC_FCR2_AESFC_Msk                GTZC_CFGR2_AES_Msk
#define GTZC_TZIC_FCR2_ADCFC_Pos                GTZC_CFGR2_ADC_Pos
#define GTZC_TZIC_FCR2_ADCFC_Msk                GTZC_CFGR2_ADC_Msk
#define GTZC_TZIC_FCR2_ICACHE_REGFC_Pos         GTZC_CFGR2_ICACHE_REG_Pos
#define GTZC_TZIC_FCR2_ICACHE_REGFC_Msk         GTZC_CFGR2_ICACHE_REG_Msk
#define GTZC_TZIC_FCR2_TSCFC_Pos                GTZC_CFGR2_TSC_Pos
#define GTZC_TZIC_FCR2_TSCFC_Msk                GTZC_CFGR2_TSC_Msk
#define GTZC_TZIC_FCR2_CRCFC_Pos                GTZC_CFGR2_CRC_Pos
#define GTZC_TZIC_FCR2_CRCFC_Msk                GTZC_CFGR2_CRC_Msk
#define GTZC_TZIC_FCR2_DFSDM1FC_Pos             GTZC_CFGR2_DFSDM1_Pos
#define GTZC_TZIC_FCR2_DFSDM1FC_Msk             GTZC_CFGR2_DFSDM1_Msk
#define GTZC_TZIC_FCR2_SAI2FC_Pos               GTZC_CFGR2_SAI2_Pos
#define GTZC_TZIC_FCR2_SAI2FC_Msk               GTZC_CFGR2_SAI2_Msk
#define GTZC_TZIC_FCR2_SAI1FC_Pos               GTZC_CFGR2_SAI1_Pos
#define GTZC_TZIC_FCR2_SAI1FC_Msk               GTZC_CFGR2_SAI1_Msk
#define GTZC_TZIC_FCR2_TIM17FC_Pos              GTZC_CFGR2_TIM17_Pos
#define GTZC_TZIC_FCR2_TIM17FC_Msk              GTZC_CFGR2_TIM17_Msk
#define GTZC_TZIC_FCR2_TIM16FC_Pos              GTZC_CFGR2_TIM16_Pos
#define GTZC_TZIC_FCR2_TIM16FC_Msk              GTZC_CFGR2_TIM16_Msk
#define GTZC_TZIC_FCR2_TIM15FC_Pos              GTZC_CFGR2_TIM15_Pos
#define GTZC_TZIC_FCR2_TIM15FC_Msk              GTZC_CFGR2_TIM15_Msk
#define GTZC_TZIC_FCR2_USART1FC_Pos             GTZC_CFGR2_USART1_Pos
#define GTZC_TZIC_FCR2_USART1FC_Msk             GTZC_CFGR2_USART1_Msk
#define GTZC_TZIC_FCR2_TIM8FC_Pos               GTZC_CFGR2_TIM8_Pos
#define GTZC_TZIC_FCR2_TIM8FC_Msk               GTZC_CFGR2_TIM8_Msk

/******************  Bits definition for GTZC_TZIC_FCR3 register  ****************/
#define GTZC_TZIC_FCR3_MPCBB2_REGFC_Pos         GTZC_CFGR3_MPCBB2_REG_Pos
#define GTZC_TZIC_FCR3_MPCBB2_REGFC_Msk         GTZC_CFGR3_MPCBB2_REG_Msk
#define GTZC_TZIC_FCR3_MPCBB2FC_Pos             GTZC_CFGR3_SRAM2_Pos
#define GTZC_TZIC_FCR3_MPCBB2FC_Msk             GTZC_CFGR3_SRAM2_Msk
#define GTZC_TZIC_FCR3_MPCBB1_REGFC_Pos         GTZC_CFGR3_MPCBB1_REG_Pos
#define GTZC_TZIC_FCR3_MPCBB1_REGFC_Msk         GTZC_CFGR3_MPCBB1_REG_Msk
#define GTZC_TZIC_FCR3_MPCBB1FC_Pos             GTZC_CFGR3_SRAM1_Pos
#define GTZC_TZIC_FCR3_MPCBB1FC_Msk             GTZC_CFGR3_MPCBB1_Msk
#define GTZC_TZIC_FCR3_OCTOSPI1_MEMFC_Pos       GTZC_CFGR3_OCTOSPI1_MEM_Pos
#define GTZC_TZIC_FCR3_OCTOSPI1_MEMFC_Msk       GTZC_CFGR3_OCTOSPI1_MEM_Msk
#define GTZC_TZIC_FCR3_FMC_MEMFC_Pos            GTZC_CFGR3_FMC_MEM_Pos
#define GTZC_TZIC_FCR3_FMC_MEMFC_Msk            GTZC_CFGR3_FMC_MEM_Msk
#define GTZC_TZIC_FCR3_TZICFC_Pos               GTZC_CFGR3_TZIC_Pos
#define GTZC_TZIC_FCR3_TZICFC_Msk               GTZC_CFGR3_TZIC_Msk
#define GTZC_TZIC_FCR3_TZSCFC_Pos               GTZC_CFGR3_TZSC_Pos
#define GTZC_TZIC_FCR3_TZSCFC_Msk               GTZC_CFGR3_TZSC_Msk

/*******************  Bits definition for GTZC_MPCBB_CR register  *****************/
#define GTZC_MPCBB_CR_LCK_Pos          (0U)
#define GTZC_MPCBB_CR_LCK_Msk          (0x01UL << GTZC_MPCBB_CR_LCK_Pos)         /*!< 0x00000001 */
#define GTZC_MPCBB_CR_INVSECSTATE_Pos  (30U)
#define GTZC_MPCBB_CR_INVSECSTATE_Msk  (0x01UL << GTZC_MPCBB_CR_INVSECSTATE_Pos) /*!< 0x40000000 */
#define GTZC_MPCBB_CR_SRWILADIS_Pos    (31U)
#define GTZC_MPCBB_CR_SRWILADIS_Msk    (0x01UL << GTZC_MPCBB_CR_SRWILADIS_Pos)   /*!< 0x80000000 */

